<a href="https://colab.research.google.com/github/danielbr20998/Atividades-Senai/blob/main/Atividade_9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Crie uma Series chamada temperaturas com os valores:
# [22, 25, 19, 28, 23] e índices ['Seg', 'Ter', 'Qua', 'Qui', 'Sex'].
# Exiba a Series completa.

import pandas as pd
import numpy as np
import statistics as st

In [ ]:
temperaturas = pd.Series([22, 25, 19, 28, 23], index=['Seg', 'Ter', 'Qua', 'Qui', 'Sex'])

In [ ]:
temperaturas

Seg    22
Ter    26
Qua    19
Qui    28
Sex    23
dtype: int64

In [ ]:
# Acesse e exiba o valor da temperatura de 'Qua'.
# Acesse e exiba os valores de temperatura dos dias 'Seg' e 'Sex'.

In [ ]:
temperaturas.iloc[0:5:2]

Seg    22
Qua    19
Sex    23
dtype: int64

In [ ]:
# Manipulação de Valores em Series:
# Altere a temperatura de 'Ter' para 26. Exiba a Series após a alteração.
# Multiplique todos os valores da Series por 1.5. Exiba o resultado.

In [ ]:
temperaturas['Ter']=26
print(temperaturas)

Seg    22
Ter    26
Qua    19
Qui    28
Sex    23
dtype: int64

In [ ]:
temperaturas2=temperaturas*1.5
print(temperaturas2)

Seg    33.0
Ter    39.0
Qua    28.5
Qui    42.0
Sex    34.5
dtype: float64

In [ ]:
# Filtragem e Nulos em Series:
# Exiba apenas as temperaturas que são maiores que 24.
# Crie uma nova Series chamada estoque com os valores:
# [100, 150, np.nan, 80, 120] e índices:
# ['Produto A', 'Produto B', 'Produto C', 'Produto D', 'Produto E'].
# Verifique e exiba quais elementos da Series estoque são nulos.

In [ ]:
temperaturas3=temperaturas[temperaturas>24]
temperaturas3

Ter    26
Qui    28
dtype: int64

In [ ]:
estoque = pd.Series([100, 150, np.nan, 80, 120], index=['Produto A', 'Produto B', 'Produto C', 'Produto D', 'Produto E'])
estoque

Produto A    100.0
Produto B    150.0
Produto C      NaN
Produto D     80.0
Produto E    120.0
dtype: float64

In [ ]:
estoque.isnull()

Produto A    False
Produto B    False
Produto C     True
Produto D    False
Produto E    False
dtype: bool